tintinnabulate/ch32v003fun/extralibs/iSLER.h
#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <string.h>

#if defined(CH57x) && (MCU_PACKAGE == 0 || MCU_PACKAGE == 2)
#define CH570_CH572
#define CRCPOLY1           BB2
#define ACCESSADDRESS1     BB3
#define CTRL_TX            BB13
#define CRCINIT2           BB22
#define CRCPOLY2           BB23
#define ACCESSADDRESS2     BB24
#define TMR                LL25
#define FRAME_BUF          LL30
#define STATE_BUF          LL31
#define CTRL_MOD_RFSTOP    0xfffff8ff
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffcffff) | 0x20000)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffcffff) | 0x10000)
#define DEVSETMODE_TUNE    0x0558
#define DEVSETMODE_TX      0x0258
#define DEVSETMODE_RX      0x0158
#define CTRL_CFG_PHY_1M    ((BB->CTRL_CFG & 0xfffffcff) | 0x100)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG & 0xfffffcff)
#define LL_STATUS_TX       0x20000
#define CTRL_CFG_START_TX  0x1000000
#elif defined(CH57x) && (MCU_PACKAGE == 1 || MCU_PACKAGE == 3)
#define CH571_CH573
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define TMR                LL24
#define FRAME_BUF          LL28
#define STATE_BUF          LL29
#define RFEND_TXCTUNE_INIT 0x180000
#define CTRL_MOD_RFSTOP    0xfffffff8
#define DEVSETMODE_TUNE    0x5d
#define DEVSETMODE_TX      0x5a
#define DEVSETMODE_RX      0x59
#define CTRL_CFG_PHY_1M    (BB->CTRL_CFG | 0x10000000)
#define LL_STATUS_TX       0x20000
#define CTRL_CFG_START_TX  (BB->CTRL_CFG & 0xefffffff)
#elif defined(CH58x) && (MCU_PACKAGE == 2 || MCU_PACKAGE == 3)
#define CH582_CH583
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define TMR                LL25
#define FRAME_BUF          LL28
#define STATE_BUF          LL29
#define RFEND_TXCTUNE_INIT 0x880000
#define CTRL_TX_TXPOWER    0x80010e78
#define CTRL_MOD_RFSTOP    0xfffffff8
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffffe7f) | 0x100)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffffe7f) | 0x80)
#define DEVSETMODE_TUNE    0x00dd
#define DEVSETMODE_TX      0x00da
#define DEVSETMODE_RX      0x00d9
#define CTRL_CFG_PHY_1M    ((BB->CTRL_CFG & 0xffff0fff) | 0x1000)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG & 0xffff0fff)
#define CTRL_CFG_PHY_CODED ((BB->CTRL_CFG & 0xffff0fff) | 0x2000)
#define LL_STATUS_TX       0x2000
#define CTRL_CFG_START_TX  0x800000
#elif (defined(CH59x) && (MCU_PACKAGE == 1 || MCU_PACKAGE == 2)) || (defined(CH58x) && (MCU_PACKAGE == 4 || MCU_PACKAGE == 5))
#if defined(CH59x)
#define CH591_CH592
#elif defined(CH58x)
#define CH584_CH585
#endif
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define TMR                LL25
#define FRAME_BUF          LL30
#define STATE_BUF          LL31
#define CTRL_MOD_RFSTOP    0xfffff8ff
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffffcff) | 0x280)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffffcff) | 0x100)
#define DEVSETMODE_TUNE    0x0558
#define DEVSETMODE_TX      0x0258
#define DEVSETMODE_RX      0x0158
#define CTRL_CFG_PHY_1M    (BB->CTRL_CFG & 0xffffff7f)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG | 0x80)
#define LL_STATUS_TX       0x20000
#define CTRL_CFG_START_TX  0x800000
#elif defined(CH32V20x)
#define CH32V208
#define ACCESSADDRESS1     BB2
#define CTRL_TX            BB11
#define TMR                LL25
#define FRAME_BUF          LL28
#define STATE_BUF          LL29
#define RFEND_TXCTUNE_INIT 0x100000
#define CTRL_TX_TXPOWER    0x80010ec8
#define CTRL_MOD_RFSTOP    0xfffffff8
#define DEVSETMODE_ON      ((BB->CTRL_CFG & 0xfffffe7f) | 0x100)
#define DEVSETMODE_OFF     ((BB->CTRL_CFG & 0xfffffe7f) | 0x80)
#define DEVSETMODE_TUNE    0x5d
#define DEVSETMODE_TX      0x5a
#define DEVSETMODE_RX      0x59
#define CTRL_CFG_PHY_1M    ((BB->CTRL_CFG & 0xffff0fff) | 0x1000)
#define CTRL_CFG_PHY_2M    (BB->CTRL_CFG & 0xffff0fff)
#define CTRL_CFG_PHY_CODED ((BB->CTRL_CFG & 0xffff0fff) | 0x2000)
#define LL_STATUS_TX       0x2000
#define CTRL_CFG_START_TX  0x800000
#else
#error "MCU_TARGET selected in Makefile is not supported"
#endif

#ifdef CH32V208
#define BB_BASE  (0x40024100) // Baseband, digital part of the PHY
#define LL_BASE  (0x40024200) // Link Layer, MAC
#define RF_BASE  (0x40025000) // Radio frontend, analog part of the PHY
#else
#define DMA_BASE (0x4000c000)
#define BB_BASE  (0x4000c100)
#define LL_BASE  (0x4000c200)
#define RF_BASE  (0x4000d000)
#endif

#define DMA ((DMA_Type *) DMA_BASE)
#define BB  ((BB_Type *)  BB_BASE)
#define LL  ((LL_Type *)  LL_BASE)
#define RF  ((RF_Type *)  RF_BASE)

#ifdef CH571_CH573
typedef struct {
	volatile uint32_t DMA0;
	volatile uint32_t DMA1;
	volatile uint32_t DMA2;
	volatile uint32_t DMA3;
	volatile uint32_t DMA4;
	volatile uint32_t DMA5;
	volatile uint32_t DMA6;
	volatile uint32_t DMA7;
} DMA_Type;
#endif

typedef struct {
	// bits 0..5 = Channel
	// bit 6 = disable whitening.
	// bit 8 = 1 during normal TX/operation, but clearing does not affect TX.  Note: 0 at reset, set in software.
	// bit 9 = settable, but unknown effect.
	// bit 10 = 1 during normal TX/operation, but clearing does not affect TX.  Note: 1 at reset, not touched in software.
	// bit 16 = cleared by firmware upon TX, but does not seem to have an effect on the TX.
	// bit 17 = settable, but unknown effect
	// bit 20 = settable, but unknown effect.
	// bit 24 = set at end of tx routine
	// bit 29-31 = settable, but unknown effect.
	volatile uint32_t CTRL_CFG;

	volatile uint32_t CRCINIT1;
	volatile uint32_t BB2; // ch570/2: CRCPOLY1, [ch582/3 ch591/2]: ACCESSADDRESS1
	volatile uint32_t BB3; // ch570/2 ACCESSADDRESS1
	volatile uint32_t BB4;
	volatile uint32_t BB5;
	volatile uint32_t BB6;
	volatile uint32_t BB7;
	volatile uint32_t BB8;
	volatile uint32_t BB9;
	volatile uint32_t BB10;
	volatile uint32_t BB11; // ch582/3, ch584/5, ch591/2: CTRL_TX
	volatile uint32_t BB12;

	// default, pre TX is a4000009
	// bit 0: Set normally, but cleared in software when TXing (maybe a ready bit?)
	// bit 1: Unset normally, but cleared anyway by software when TXing (maybe a fault bit?)
	// bit 2: Disables TX.
	// bit 4: Normally 0, but, if set to 1, seems to increase preamble length.
	// bit 8: Normally 0, but, if set, no clear effect.
	// bit 9: Normally 0, but, if set, no clear effect.
	// bits 24-30: TX Power.  Normally 0xA4
	// Oddly, bit 31 seems to maybe be always set.
	volatile uint32_t BB13; // ch570/2: CTRL_TX
	volatile uint32_t BB14;
	volatile uint32_t BB15;
	volatile uint32_t BB16;
	volatile uint32_t BB17;
	volatile uint32_t BB18;
	volatile uint32_t BB19;
	volatile uint32_t BB20;
	volatile uint32_t BB21;
	volatile uint32_t BB22; // ch570/2: CRCINIT2
	volatile uint32_t BB23; // ch570/2: CRCPOLY2
	volatile uint32_t BB24; // ch570/2: ACCESSADDRESS2
} BB_Type;

